boolean overButton = false;
  
void setup() {
  size(300,600);
}
 
void draw() {
  background(0,0,0);
  if (overButton == true){
  fill(255,255,255);
  } else {
    noFill();
  }
  //青
fill(108,155,210);
rect(200,100,100,100);

//水色
fill(84,195,241);
rect(100,100,100,100);
  
//黄緑
fill(193,219,129);
rect(0,0,100,100);

//オレンジ
fill(249,194,112);
rect(0,100,100,100);

//ピンク
fill(238,135,180);
rect(0,200,100,100);

//こげ茶
fill(232,172,81);
rect(200,0,100,100);

//赤紫
fill(198,0,111);
rect(100,200,100,100);

//オリーブ
fill(158,189,96);
rect(100,0,100,100);

//濃紺
fill(166,84,151);
rect(200,200,300,100);

//クリーム
fill(245,245,245);
rect(0,300,300,300); 
}
